import { ScrollArea } from "@/registry/default/ui/scroll-area";

export default function Particle() {
  return (
    <ScrollArea className="h-80 max-w-80 rounded-lg border">
      <p className="min-w-100 p-4">
        تماما كما كان قد بدأ ، توقف الإحساس ، وترك أليس تشعر بالارتباك قليلا.
        نظرت حولها وأدركت أن الغرفة لم تتغير على الإطلاق - كانت هي التي نمت أصغر
        ، وتقلصت إلى جزء صغير من حجمها السابق. شعرت أليس نفسها تنمو أكبر وأكبر ،
        وملأت الغرفة بأكملها حتى خشيت من أنها قد تنفجر. كان الإحساس مثيرًا ومرعبًا
        ، كما لو كانت تتوسع خارج حدود جسدها. وتساءلت عما إذا كان هذا هو ما شعرت
        به أن يكون بالون ، وتورم مع الهواء حتى لا يمكن أن تعقد أكثر من ذلك. نظرت
        أليس في المرآة ، وانعكاسها يحدق في وجهها بهواء من الأذى. وتساءلت كيف
        سيكون الأمر لو خطوة من خلال الزجاج وإلى العالم الخارجي ، حيث بدا كل شيء
        مضطربًا ولا شيء كان تمامًا كما يبدو. لا فائدة من العودة إلى الأمس ، لأنني
        كنت شخصًا مختلفًا آنذاك ، عكست أليس.
      </p>
    </ScrollArea>
  );
}
